[
  {
    "locationName": "Church",
    "isHidden": false
  },
  {
    "actor": "Player",
    "text": "Good day, High Priest. I have been curious about the sudden changes that occurred in the Sorcerer Order five years ago. Can you shed some light on the matter?"
  },
  {
    "actor": "High Priest of Rauðagnúpur",
    "text": "Ah, greetings, my child. I understand your curiosity. Indeed, five years ago, there were significant changes in our Order."
  },
  {
    "actor": "Player",
    "text": "Yes, I have heard that the Order became more radical and strict. Can you tell me why that happened?"
  },
  {
    "actor": "High Priest of Rauðagnúpur",
    "text": "It all began with a messenger who came to us five years ago, speaking of a new organization. This new group promised greater power and knowledge, but it came with a cost - strict adherence to a particular set of beliefs and practices."
  },
  {
    "actor": "Player",
    "text": "That sounds ominous. What happened next?"
  },
  {
    "actor": "High Priest of Rauðagnúpur",
    "text": "Many of our younger members were swayed by this promise of power and knowledge, and they left to join the new organization. Our Order was left with a significant loss of manpower, but we remained true to our beliefs and practices."
  },
  {
    "actor": "Player",
    "text": "I see. Was there any particular reason why the new organization was so attractive to our members?"
  },
  {
    "actor": "High Priest of Rauðagnúpur",
    "text": "It promised quick results and instant gratification, which is always tempting. But such power often comes at a price. We believe in taking the long road, in learning and growing through practice and dedication."
  },
  {
    "actor": "Player",
    "text": "Thank you for clarifying, High Priest. The idea of a new organization still raises some concerns, but I understand that the changes in the Sorcerer Order were a significant event. I would still like to speak with the retired High Priest about what happened five years ago."
  },
  {
    "actor": "High Priest of Rauðagnúpur",
    "text": "Of course, my child. I understand your curiosity, and I hope that the retired High Priest can provide you with more information. He was in office during that time and would be better able to tell you what happened and why."
  },
  {
    "actor": "Player",
    "text": "Thank you, High Priest. Can you tell me where I might find the retired High Priest?"
  },
  {
    "actor": "High Priest of Rauðagnúpur",
    "text": "Yes, he is currently residing in the eastern part of town. You will find his residence near the large oak tree, next to the marketplace."
  },
  {
    "actor": "Player",
    "text": "Thank you, High Priest. I appreciate your guidance, and I will seek out the retired High Priest to learn more about the events five years ago."
  },
  {
    "actor": "High Priest of Rauðagnúpur",
    "text": "You are always welcome in our Order, my child. May you find the answers you seek."
  }
]
